package ua.goit.online.exercise5;

public class Main {
    /*Создадим гонки машин. Дано два класса, Race и Car. Car - машина, у которой есть параметры:
     *имя машины, максимальная скорость, и сколько она проехала.
     *Race - класс, который отвечает за гонки. У него есть метод startRace, который принимает коллекцию машин и с каждой машины создает отдельный поток.
     * Конструктор класса Race должен принимать дистанцию гоночного трека.
     * В методе run потока, нужно расчитать проехала ли машина дистанцию трассы. Расчитывать нужно исходя из дистанции трека и максимальной скорости машины.
     * Пример: скорость машины 200 км, а длина трека 500 км. Машина проезжает 200, засыпает на 1 секунду, потом проезжает еще 200, засыпает на секунду
     * и в третий раз уже проезжает всю дистанцию и завершает гонку.
     * Машина побеждает в гонке в тот момент, когда она первая проезжает дистанцию трека.
     * Нуно вывести список победителей.
     * Все машины должны одновременно стартовать гонку.
     */
    public static void main(String[] args) {

    }
}
