package ua.goit.online.exercise2;

public class Main {
    /* Сэмулировать гонки потоков
    * 1. Создать класс, который будет реализовывать Runnable. Этот класс должен принимать сообщение и счетчик (сколько
    * раз это сообщение нужно будет распечатать в консоль)
    * 2. СОздать экземпляр данного обьекта с первого задания и передать в него сообщение "I am the best" и счетчик 15.
    * 3. Создать 2 потока которые будут использовать  один обьект раннебл
    */
    public static void main(String[] args) {

    }

}
